log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** Why use a Cross Compiler?
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-05-18-why-use-a-cross-compiler
   :EXPORT_DATE: <2017-05-18>
   :ID:       CE63BDCE-8AA2-4D62-BD3C-376A52960158
   :END:

Since [[https://obsidian.systems][obsidian.systems]] and [[https://zw3rk.com][zw3rk]] posted the [[https://medium.com/@zw3rk/hello-world-a-cross-compilation-survey-890cb95029d7][Cross Compilation survey]]
(and [[https://medium.com/@zw3rk/cross-compilation-survey-results-3988ad1b677b][results]]), I have been writing about cross compiling to [[http://amzn.to/2re1GLQ][Raspberry
Pi]], and specifically [[https://medium.com/@zw3rk/making-a-raspbian-cross-compilation-sdk-830fe56d75ba][building a SDK for Raspbian Jessie]], and a [[https://medium.com/@zw3rk/a-haskell-cross-compiler-for-raspberry-pi-ddd9d41ced94][Haskell
cross compiler]], one topic has been coming up repeatedly: /Why use a
Cross Compiler?/

For those who work in the mobile application space, cross compilation is
very likely an essential part of their day. iOS and Android apps are
naturally cross compiled, even though this fact is mostly hidden away.
In both cases the application is developed on a much more powerful
machine than the one it is finally deployed to (or tested on).

*** Power Differences
    :PROPERTIES:
    :ID:       D9CAB8F5-90CA-46EE-A9BE-0FD63B5D795D
    :END:

This leads us to the first reason for using a cross compiler. If the
machine that /builds/ the software is much more powerful than the one
that finally /hosts/ and runs the software, it make economical sense to
use the more powerful machine to do the compilation.

*** Resource Constraints
    :PROPERTIES:
    :ID:       4663CA75-B2DD-47C0-A875-98BA4F74DD42
    :END:

Another reason to use a cross compiler is the fact that the /target/
that is finally /hosting/ the software might be ressource constraint in
a way that prohibits or severely hinders the execution of the compiler.
While the ressources are perfectly fine for running the compiled
software, they might not be adequate to run the compiler.

*** Environmental Restrictions
    :PROPERTIES:
    :ID:       739A31FB-A15C-482B-BE6D-539B4C94A373
    :END:

A third reason for using a cross compiler could stem from the
restrictions put onto the environment that governs the /target/. If the
/target/ simply does not admit to running the compiler or necessary
toolchain to compile the software, the software must be compiled on a
different /build/ machine.

--------------

Alternatives to cross compilation include building in an emulated
environment that is sufficiently close to the /target/. The /build
environment/ is then identical or sufficiently similar to the /host
environment/. If the compiler in question does not support cross
compilation this might be the only option.

Finally with cross compilation the compiler now has to deal with two
different machines. The /build/ machine on which the cross compiler can
run, but the software built by the cross compiler can not run on. And
the /host/ machine on which the built software can run, but the cross
compiler can not. We will learn more about the challenges this presents
for a Haskell cross compiler, and especially for Template Haskell next
week.

Should you use a cross compiler or not? I don't believe there is a
general answer to this. It all comes down to the constraints as
mentioned above; the feasibility and complexity of setting up (or
obtaining) the SDK, the toolchain, and the compiler compared to setting
up a virtual (or emulated) sufficiently similar environment to run a
regular compiler in.

